## Terraform Plan - Dev ✅

<details>
<summary>Show Plan</summary>

```hcl
[0m[1mmodule.compute.null_resource.build_python_layer: Refreshing state... [id=5577006791947779410][0m
[0m[1mmodule.compute.data.archive_file.participation_process_zip: Reading...[0m[0m
[0m[1mmodule.compute.data.archive_file.create_raffle_zip: Reading...[0m[0m
[0m[1mmodule.compute.data.archive_file.list_raffles_zip: Reading...[0m[0m
[0m[1mmodule.compute.data.archive_file.worker_process_zip: Reading...[0m[0m
[0m[1mmodule.compute.data.archive_file.get_raffle_zip: Reading...[0m[0m
[0m[1mmodule.compute.data.archive_file.ingest_participation_zip: Reading...[0m[0m
[0m[1mmodule.compute.data.archive_file.check_expired_raffles_zip: Reading...[0m[0m
[0m[1mmodule.compute.data.archive_file.worker_process_zip: Read complete after 0s [id=e894eba73faf116c1f65b3cf1494a3103a07f1fc][0m
[0m[1mmodule.cognito.data.archive_file.post_confirmation_zip: Reading...[0m[0m
[0m[1mmodule.compute.data.archive_file.create_raffle_zip: Read complete after 0s [id=9d656c89945cfbdd26a9048871f61f5e4e6e1418][0m
[0m[1mmodule.compute.data.archive_file.list_raffles_zip: Read complete after 0s [id=e60147eb93233a24adb021aaf06812d000bbd74e][0m
[0m[1mmodule.compute.data.archive_file.upload_image_zip: Reading...[0m[0m
[0m[1mmodule.compute.data.archive_file.get_raffle_zip: Read complete after 0s [id=899b46781d8fce8734f3afae5cee95f3c0b836ad][0m
[0m[1mmodule.compute.data.archive_file.image_optimizer_zip: Reading...[0m[0m
[0m[1mmodule.compute.data.archive_file.participation_process_zip: Read complete after 0s [id=7aa73e087de00027810edd679aaf3bc8f45a9414][0m
[0m[1mmodule.compute.data.archive_file.close_raffle_zip: Reading...[0m[0m
[0m[1mmodule.compute.data.archive_file.ingest_participation_zip: Read complete after 0s [id=ab1dae76afd99d566b5bc2a537bd837996c16592][0m
[0m[1mmodule.compute.data.archive_file.worker_process_layer_zip: Reading...[0m[0m
[0m[1mmodule.compute.data.archive_file.check_expired_raffles_zip: Read complete after 0s [id=2767d2b12066ac0750cfd759cecf64c978985ce8][0m
[0m[1mmodule.cognito.data.archive_file.post_confirmation_zip: Read complete after 0s [id=46de6e91090e7b8ffe0e893853f044843a901736][0m
[0m[1mmodule.compute.data.archive_file.image_optimizer_zip: Read complete after 0s [id=204ab47790996267f15b3d30250245804b3effa8][0m
[0m[1mmodule.compute.data.archive_file.upload_image_zip: Read complete after 0s [id=fa1e9a9b5a30cc09f840ba09a268485e69b78441][0m
[0m[1mmodule.compute.data.archive_file.close_raffle_zip: Read complete after 0s [id=e75598baecf9fa613b6eea5473d8b928590c3764][0m
[0m[1mmodule.github_oidc.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::422228629090:oidc-provider/token.actions.githubusercontent.com][0m
[0m[1mmodule.cdn.data.aws_cloudfront_cache_policy.caching_disabled: Reading...[0m[0m
[0m[1mmodule.monitoring.data.aws_region.current: Reading...[0m[0m
[0m[1mdata.aws_caller_identity.me: Reading...[0m[0m
[0m[1mmodule.api_gateway.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.github_oidc.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.ses.aws_ses_email_identity.sender: Refreshing state... [id=jcode2006@gmail.com][0m
[0m[1mmodule.api_gateway.data.aws_region.current: Read complete after 0s [id=us-east-2][0m
[0m[1mmodule.monitoring.data.aws_region.current: Read complete after 0s [id=us-east-2][0m
[0m[1mmodule.ses.aws_ses_domain_identity.main: Refreshing state... [id=rafflenow.es][0m
[0m[1mmodule.cdn.data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Reading...[0m[0m
[0m[1mmodule.route53.data.aws_route53_zone.main: Reading...[0m[0m
[0m[1mdata.aws_caller_identity.me: Read complete after 0s [id=422228629090][0m
[0m[1mmodule.scheduler.aws_cloudwatch_event_rule.check_expired_raffles: Refreshing state... [id=rafflenow-dev-422228629090-check-expired-raffles][0m
[0m[1mmodule.cognito.aws_iam_role.post_confirmation_lambda_role: Refreshing state... [id=rafflenow-dev-422228629090-post-confirmation-role][0m
[0m[1mmodule.github_oidc.data.aws_caller_identity.current: Read complete after 0s [id=422228629090][0m
[0m[1mmodule.ses.aws_ses_configuration_set.rafflenow: Refreshing state... [id=rafflenow-dev-422228629090-config-set][0m
[0m[1mmodule.ses.aws_ses_template.participation_confirmation: Refreshing state... [id=rafflenow-dev-422228629090-participation-confirmation][0m
[0m[1mmodule.cdn.data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Read complete after 0s [id=b689b0a8-53d0-40ab-baf2-68738e2966ac][0m
[0m[1mmodule.ses.aws_ses_template.winner_notification: Refreshing state... [id=rafflenow-dev-422228629090-winner-notification][0m
[0m[1mmodule.cdn.data.aws_cloudfront_cache_policy.caching_disabled: Read complete after 0s [id=4135ea2d-6df8-44a3-9df3-4b5a84be39ad][0m
[0m[1mmodule.compute.aws_iam_policy.lambda_ses_policy: Refreshing state... [id=arn:aws:iam::422228629090:policy/rafflenow-dev-422228629090-lambda-ses-policy][0m
[0m[1mmodule.api_gateway.aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=rafflenow-dev-422228629090-api-gateway-cloudwatch-dev][0m
[0m[1mmodule.api_gateway.aws_cloudwatch_log_group.authenticated_api_access_logs: Refreshing state... [id=/aws/api-gateway/rafflenow-dev-422228629090-authenticated-api-dev/access-logs][0m
[0m[1mmodule.compute.aws_iam_role.lambda_role: Refreshing state... [id=rafflenow-dev-422228629090-lambda-role][0m
[0m[1mmodule.api_gateway.aws_cloudwatch_log_group.public_api_access_logs: Refreshing state... [id=/aws/api-gateway/rafflenow-dev-422228629090-public-api-dev/access-logs][0m
[0m[1mmodule.api_gateway.aws_api_gateway_rest_api.public_api: Refreshing state... [id=qp4jr69io5][0m
[0m[1mmodule.cdn.aws_cloudfront_response_headers_policy.cors_policy: Refreshing state... [id=3540de38-a555-43ea-af71-e144c00d4081][0m
[0m[1mmodule.cdn.aws_cloudfront_cache_policy.assets_cache_policy: Refreshing state... [id=e1881fb7-e3a5-41b8-87ca-54d3b3deadee][0m
[0m[1mmodule.storage.aws_dynamodb_table.participations: Refreshing state... [id=rafflenow-dev-422228629090-participations][0m
[0m[1mmodule.storage.aws_sqs_queue.image_optimizer_dlq: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/422228629090/rafflenow-dev-422228629090-image-optimizer-dlq][0m
[0m[1mmodule.storage.aws_sqs_queue.raffle_winner_queue: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/422228629090/rafflenow-dev-422228629090-raffle-winner-queue][0m
[0m[1mmodule.api_gateway.aws_api_gateway_rest_api.authenticated_api: Refreshing state... [id=v2yvwa8fi4][0m
[0m[1mmodule.route53.data.aws_route53_zone.main: Read complete after 1s [id=Z1005008KTEZ4T3W4W83][0m
[0m[1mmodule.waf.aws_cloudwatch_log_group.waf_regional: Refreshing state... [id=aws-waf-logs-rafflenow-dev-422228629090-regional][0m
[0m[1mmodule.storage.aws_sqs_queue.image_optimizer_queue: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/422228629090/rafflenow-dev-422228629090-image-optimizer-queue][0m
[0m[1mmodule.storage.aws_s3_bucket.assets: Refreshing state... [id=rafflenow-dev-422228629090-assets][0m
[0m[1mmodule.storage.aws_dynamodb_table.raffles: Refreshing state... [id=rafflenow-dev-422228629090-raffles][0m
[0m[1mmodule.storage.aws_sqs_queue.raffle_winner_dlq: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/422228629090/rafflenow-dev-422228629090-raffle-winner-dlq][0m
[0m[1mmodule.storage.aws_dynamodb_table.winners: Refreshing state... [id=rafflenow-dev-422228629090-winners][0m
[0m[1mmodule.eventbridge.aws_cloudwatch_event_bus.rafflenow: Refreshing state... [id=rafflenow-dev-422228629090-event-bus][0m
[0m[1mmodule.storage.aws_sqs_queue.participations_queue: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/422228629090/rafflenow-dev-422228629090-participations-queue][0m
[0m[1mmodule.eventbridge.aws_iam_role.eventbridge_sqs_role: Refreshing state... [id=rafflenow-dev-422228629090-eventbridge-sqs-role][0m
[0m[1mmodule.storage.aws_sqs_queue.participations_dlq: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/422228629090/rafflenow-dev-422228629090-participations-dlq][0m
[0m[1mmodule.cdn.aws_cloudfront_origin_access_identity.assets_oai: Refreshing state... [id=E1LQTVQN7SAZUQ][0m
[0m[1mmodule.route53.aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:us-east-1:422228629090:certificate/9e10c0de-1058-48fb-b78f-4f98b1efcdcf][0m
[0m[1mmodule.waf.aws_cloudwatch_log_group.waf_cloudfront: Refreshing state... [id=aws-waf-logs-rafflenow-dev-422228629090-cloudfront][0m
[0m[1mmodule.github_oidc.aws_iam_role.github_actions: Refreshing state... [id=rafflenow-github-actions][0m
[0m[1mmodule.ses.aws_ses_domain_dkim.main: Refreshing state... [id=rafflenow.es][0m
[0m[1mmodule.ses.aws_ses_domain_mail_from.main: Refreshing state... [id=rafflenow.es][0m
[0m[1mmodule.cognito.aws_iam_role_policy_attachment.post_confirmation_xray: Refreshing state... [id=rafflenow-dev-422228629090-post-confirmation-role/arn:aws:iam::aws:policy/AWSXRayDaemonWriteAccess][0m
[0m[1mmodule.cognito.aws_iam_role_policy_attachment.post_confirmation_basic: Refreshing state... [id=rafflenow-dev-422228629090-post-confirmation-role/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole][0m
[0m[1mmodule.cognito.aws_lambda_function.post_confirmation: Refreshing state... [id=rafflenow-dev-422228629090-post-confirmation][0m
[0m[1mmodule.compute.aws_iam_role_policy_attachment.lambda_xray: Refreshing state... [id=rafflenow-dev-422228629090-lambda-role/arn:aws:iam::aws:policy/AWSXRayDaemonWriteAccess][0m
[0m[1mmodule.compute.aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=rafflenow-dev-422228629090-lambda-role/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole][0m
[0m[1mmodule.compute.aws_iam_role_policy_attachment.lambda_ses: Refreshing state... [id=rafflenow-dev-422228629090-lambda-role/arn:aws:iam::422228629090:policy/rafflenow-dev-422228629090-lambda-ses-policy][0m
[0m[1mmodule.api_gateway.aws_iam_role_policy.api_gateway_cloudwatch: Refreshing state... [id=rafflenow-dev-422228629090-api-gateway-cloudwatch-dev:rafflenow-dev-422228629090-api-gateway-cloudwatch-policy][0m
[0m[1mmodule.api_gateway.aws_api_gateway_resource.public_api: Refreshing state... [id=lku1eo][0m
[0m[1mmodule.api_gateway.aws_api_gateway_resource.authenticated_api: Refreshing state... [id=00sre7][0m
[0m[1mmodule.storage.aws_sqs_queue_redrive_policy.image_optimizer_queue_redrive: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/422228629090/rafflenow-dev-422228629090-image-optimizer-queue][0m
[0m[1mmodule.storage.aws_sqs_queue_redrive_policy.raffle_winner_queue_redrive: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/422228629090/rafflenow-dev-422228629090-raffle-winner-queue][0m
[0m[1mmodule.eventbridge.aws_cloudwatch_event_rule.raffle_closed: Refreshing state... [id=rafflenow-dev-422228629090-event-bus/rafflenow-dev-422228629090-raffle-closed][0m
[0m[1mmodule.eventbridge.aws_cloudwatch_event_rule.participation_received: Refreshing state... [id=rafflenow-dev-422228629090-event-bus/rafflenow-dev-422228629090-participation-received][0m
[0m[1mmodule.eventbridge.aws_cloudwatch_event_rule.raffle_created: Refreshing state... [id=rafflenow-dev-422228629090-event-bus/rafflenow-dev-422228629090-raffle-created][0m
[0m[1mmodule.storage.aws_sqs_queue_redrive_policy.participations_queue_redrive: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/422228629090/rafflenow-dev-422228629090-participations-queue][0m
[0m[1mmodule.github_oidc.aws_iam_role_policy_attachment.admin_access: Refreshing state... [id=rafflenow-github-actions/arn:aws:iam::aws:policy/AdministratorAccess][0m
[0m[1mmodule.route53.aws_route53_record.cert_validation["*.rafflenow.es"]: Refreshing state... [id=Z1005008KTEZ4T3W4W83__31d98d83462a10dc35830569d3bd25d6.rafflenow.es._CNAME][0m
[0m[1mmodule.route53.aws_route53_record.cert_validation["rafflenow.es"]: Refreshing state... [id=Z1005008KTEZ4T3W4W83__31d98d83462a10dc35830569d3bd25d6.rafflenow.es._CNAME][0m
[0m[1mmodule.api_gateway.aws_api_gateway_account.main: Refreshing state... [id=422228629090][0m
[0m[1mmodule.compute.data.archive_file.worker_process_layer_zip: Read complete after 1s [id=6e086d36c1c12e9df1a882e5b6ab16689eb30848][0m
[0m[1mmodule.api_gateway.aws_api_gateway_resource.public_v1: Refreshing state... [id=judtk3][0m
[0m[1mmodule.api_gateway.aws_api_gateway_resource.authenticated_v1: Refreshing state... [id=u3plbu][0m
[0m[1mmodule.ses.aws_route53_record.ses_verification: Refreshing state... [id=Z1005008KTEZ4T3W4W83__amazonses.rafflenow.es_TXT][0m
[0m[1mmodule.ses.aws_route53_record.ses_dkim[2]: Refreshing state... [id=Z1005008KTEZ4T3W4W83_bu2ezlumqf7zwaebfkeniuuiow2sed6b._domainkey.rafflenow.es_CNAME][0m
[0m[1mmodule.ses.aws_route53_record.ses_dkim[0]: Refreshing state... [id=Z1005008KTEZ4T3W4W83_enzdefiairqsjcqnnulwsaenuqpey5wt._domainkey.rafflenow.es_CNAME][0m
[0m[1mmodule.ses.aws_route53_record.ses_dkim[1]: Refreshing state... [id=Z1005008KTEZ4T3W4W83_nxwac37skddb7hiiu332gvr3oka464cu._domainkey.rafflenow.es_CNAME][0m
[0m[1mmodule.ses.aws_route53_record.ses_spf_mail_from: Refreshing state... [id=Z1005008KTEZ4T3W4W83_mail.rafflenow.es_TXT][0m
[0m[1mmodule.ses.aws_route53_record.ses_mx_mail_from: Refreshing state... [id=Z1005008KTEZ4T3W4W83_mail.rafflenow.es_MX][0m
[0m[1mmodule.ses.aws_route53_record.dmarc: Refreshing state... [id=Z1005008KTEZ4T3W4W83__dmarc.rafflenow.es_TXT][0m
[0m[1mmodule.monitoring.aws_cloudwatch_contributor_insight_rule.top_user_agents[0]: Refreshing state...[0m
[0m[1mmodule.monitoring.aws_cloudwatch_contributor_insight_rule.top_ips_5xx_errors[0]: Refreshing state...[0m
[0m[1mmodule.monitoring.aws_cloudwatch_contributor_insight_rule.top_users_requests[0]: Refreshing state...[0m
[0m[1mmodule.monitoring.aws_cloudwatch_contributor_insight_rule.top_endpoints_latency[0]: Refreshing state...[0m
[0m[1mmodule.eventbridge.aws_sqs_queue_policy.winners_queue_eventbridge: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/422228629090/rafflenow-dev-422228629090-raffle-winner-queue][0m
[0m[1mmodule.eventbridge.aws_cloudwatch_event_target.raffle_closed_to_sqs: Refreshing state... [id=rafflenow-dev-422228629090-event-bus-rafflenow-dev-422228629090-raffle-closed-SendToSQSWinnersQueue][0m
[0m[1mmodule.compute.aws_lambda_layer_version.worker_process_dependencies: Refreshing state... [id=arn:aws:lambda:us-east-2:422228629090:layer:rafflenow-dev-422228629090-worker-process-dependencies:10][0m
[0m[1mmodule.compute.aws_iam_policy.lambda_eventbridge_policy: Refreshing state... [id=arn:aws:iam::422228629090:policy/rafflenow-dev-422228629090-lambda-eventbridge-policy][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.sqs_queue_depth_high: Refreshing state... [id=rafflenow-dev-422228629090-sqs-queue-depth-high][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.dlq_winner_not_empty: Refreshing state... [id=rafflenow-dev-422228629090-dlq-winner-not-empty][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.dlq_image_not_empty: Refreshing state... [id=rafflenow-dev-422228629090-dlq-image-not-empty][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.dlq_participations_not_empty: Refreshing state... [id=rafflenow-dev-422228629090-dlq-participations-not-empty][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.sqs_message_age_warning: Refreshing state... [id=rafflenow-dev-422228629090-sqs-message-age-warning][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.sqs_message_age_critical: Refreshing state... [id=rafflenow-dev-422228629090-sqs-message-age-critical][0m
[0m[1mmodule.storage.aws_s3_bucket_versioning.assets_versioning: Refreshing state... [id=rafflenow-dev-422228629090-assets][0m
[0m[1mmodule.waf.aws_wafv2_web_acl.cloudfront: Refreshing state... [id=591e37e3-fcab-4daa-b5f6-98a25f883671][0m
[0m[1mmodule.storage.aws_s3_bucket_notification.assets_eventbridge: Refreshing state... [id=rafflenow-dev-422228629090-assets][0m
[0m[1mmodule.compute.aws_iam_policy.lambda_sqs_policy: Refreshing state... [id=arn:aws:iam::422228629090:policy/rafflenow-dev-422228629090-lambda-sqs-policy][0m
[0m[1mmodule.eventbridge.aws_iam_policy.eventbridge_sqs_policy: Refreshing state... [id=arn:aws:iam::422228629090:policy/rafflenow-dev-422228629090-eventbridge-sqs-policy][0m
[0m[1mmodule.compute.aws_iam_policy.lambda_dynamodb_policy: Refreshing state... [id=arn:aws:iam::422228629090:policy/rafflenow-dev-422228629090-lambda-dynamodb-policy][0m
[0m[1mmodule.compute.aws_lambda_function.close_raffle: Refreshing state... [id=rafflenow-dev-422228629090-close-raffle][0m
[0m[1mmodule.compute.aws_lambda_function.participation_process: Refreshing state... [id=rafflenow-dev-422228629090-participation-process][0m
[0m[1mmodule.compute.aws_lambda_function.create_raffle: Refreshing state... [id=rafflenow-dev-422228629090-create-raffle][0m
[0m[1mmodule.compute.aws_lambda_function.ingest_participation: Refreshing state... [id=rafflenow-dev-422228629090-ingest-participation][0m
[0m[1mmodule.compute.aws_lambda_function.check_expired_raffles: Refreshing state... [id=rafflenow-dev-422228629090-check-expired-raffles][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.dynamodb_throttles_raffles: Refreshing state... [id=rafflenow-dev-422228629090-dynamodb-throttles-raffles][0m
[0m[1mmodule.compute.aws_lambda_function.list_raffles: Refreshing state... [id=rafflenow-dev-422228629090-list-raffles][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.dynamodb_throttles_participations: Refreshing state... [id=rafflenow-dev-422228629090-dynamodb-throttles-participations][0m
[0m[1mmodule.route53.aws_acm_certificate_validation.main: Refreshing state... [id=2025-11-30 23:55:08.34 +0000 UTC][0m
[0m[1mmodule.eventbridge.aws_cloudwatch_event_target.participation_received_to_sqs: Refreshing state... [id=rafflenow-dev-422228629090-event-bus-rafflenow-dev-422228629090-participation-received-SendToSQSParticipationsQueue][0m
[0m[1mmodule.eventbridge.aws_sqs_queue_policy.participations_queue_eventbridge: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/422228629090/rafflenow-dev-422228629090-participations-queue][0m
[0m[1mmodule.api_gateway.aws_api_gateway_resource.authenticated_assets: Refreshing state... [id=h5mbp8][0m
[0m[1mmodule.api_gateway.aws_api_gateway_resource.authenticated_raffles: Refreshing state... [id=nzk0cl][0m
[0m[1mmodule.api_gateway.aws_api_gateway_resource.public_public: Refreshing state... [id=tyfmb2][0m
[0m[1mmodule.cognito.aws_cognito_user_pool.rafflenow_pool: Refreshing state... [id=us-east-2_k4ExaaLU9][0m
[0m[1mmodule.ses.aws_ses_domain_identity_verification.main: Refreshing state... [id=rafflenow.es][0m
[0m[1mmodule.compute.aws_lambda_function.worker_process: Refreshing state... [id=rafflenow-dev-422228629090-worker-process][0m
[0m[1mmodule.compute.aws_iam_role_policy_attachment.lambda_eventbridge: Refreshing state... [id=rafflenow-dev-422228629090-lambda-role/arn:aws:iam::422228629090:policy/rafflenow-dev-422228629090-lambda-eventbridge-policy][0m
[0m[1mmodule.compute.aws_iam_role_policy_attachment.lambda_sqs: Refreshing state... [id=rafflenow-dev-422228629090-lambda-role/arn:aws:iam::422228629090:policy/rafflenow-dev-422228629090-lambda-sqs-policy][0m
[0m[1mmodule.eventbridge.aws_iam_role_policy_attachment.eventbridge_sqs: Refreshing state... [id=rafflenow-dev-422228629090-eventbridge-sqs-role/arn:aws:iam::422228629090:policy/rafflenow-dev-422228629090-eventbridge-sqs-policy][0m
[0m[1mmodule.compute.aws_iam_role_policy_attachment.lambda_dynamodb: Refreshing state... [id=rafflenow-dev-422228629090-lambda-role/arn:aws:iam::422228629090:policy/rafflenow-dev-422228629090-lambda-dynamodb-policy][0m
[0m[1mmodule.compute.aws_lambda_event_source_mapping.sqs_to_participation_process: Refreshing state... [id=babe60a0-54c8-490d-b627-d19aad9e15a5][0m
[0m[1mmodule.api_gateway.aws_api_gateway_resource.authenticated_assets_upload: Refreshing state... [id=u62pil][0m
[0m[1mmodule.api_gateway.aws_api_gateway_resource.authenticated_raffle_id: Refreshing state... [id=qtkisl][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method.authenticated_options_raffles: Refreshing state... [id=agm-v2yvwa8fi4-nzk0cl-OPTIONS][0m
[0m[1mmodule.cdn.aws_s3_bucket_versioning.assets_versioning: Refreshing state... [id=rafflenow-dev-422228629090-assets][0m
[0m[1mmodule.compute.aws_lambda_function.upload_image: Refreshing state... [id=rafflenow-dev-422228629090-upload-image][0m
[0m[1mmodule.cdn.aws_s3_bucket_lifecycle_configuration.assets_lifecycle: Refreshing state... [id=rafflenow-dev-422228629090-assets][0m
[0m[1mmodule.cdn.aws_s3_bucket_policy.assets_policy: Refreshing state... [id=rafflenow-dev-422228629090-assets][0m
[0m[1mmodule.compute.aws_lambda_function.image_optimizer: Refreshing state... [id=rafflenow-dev-422228629090-image-optimizer][0m
[0m[1mmodule.compute.aws_iam_policy.lambda_s3_policy: Refreshing state... [id=arn:aws:iam::422228629090:policy/rafflenow-dev-422228629090-lambda-s3-policy][0m
[0m[1mmodule.eventbridge.aws_cloudwatch_event_rule.s3_object_created: Refreshing state... [id=rafflenow-dev-422228629090-s3-object-created][0m
[0m[1mmodule.api_gateway.aws_api_gateway_resource.public_raffles: Refreshing state... [id=xzskfc][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method.authenticated_options_assets_upload: Refreshing state... [id=agm-v2yvwa8fi4-u62pil-OPTIONS][0m
[0m[1mmodule.api_gateway.aws_api_gateway_resource.authenticated_close: Refreshing state... [id=2n83hs][0m
[0m[1mmodule.api_gateway.aws_api_gateway_resource.authenticated_participate: Refreshing state... [id=b4g9nm][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method_response.authenticated_options_raffles_200: Refreshing state... [id=agmr-v2yvwa8fi4-nzk0cl-OPTIONS-200][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration.authenticated_options_raffles_mock: Refreshing state... [id=agi-v2yvwa8fi4-nzk0cl-OPTIONS][0m
[0m[1mmodule.compute.aws_lambda_event_source_mapping.sqs_to_worker: Refreshing state... [id=a9f8bfd1-e271-4a37-8799-42b5c59ff4b1][0m
[0m[1mmodule.eventbridge.aws_cloudwatch_event_target.s3_object_created_to_sqs: Refreshing state... [id=rafflenow-dev-422228629090-s3-object-created-SendToSQSImageOptimizerQueue][0m
[0m[1mmodule.eventbridge.aws_sqs_queue_policy.image_optimizer_queue_eventbridge: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/422228629090/rafflenow-dev-422228629090-image-optimizer-queue][0m
[0m[1mmodule.compute.aws_iam_role_policy_attachment.lambda_s3: Refreshing state... [id=rafflenow-dev-422228629090-lambda-role/arn:aws:iam::422228629090:policy/rafflenow-dev-422228629090-lambda-s3-policy][0m
[0m[1mmodule.api_gateway.aws_lambda_permission.authenticated_api_gateway_invoke_close_raffle: Refreshing state... [id=AllowAuthenticatedAPIGatewayInvokeCloseRaffle][0m
[0m[1mmodule.api_gateway.aws_lambda_permission.authenticated_api_gateway_invoke_ingest_participation: Refreshing state... [id=AllowAuthenticatedAPIGatewayInvokeIngestParticipation][0m
[0m[1mmodule.scheduler.aws_lambda_permission.allow_eventbridge: Refreshing state... [id=AllowExecutionFromEventBridge][0m
[0m[1mmodule.scheduler.aws_cloudwatch_event_target.check_expired_raffles_lambda: Refreshing state... [id=rafflenow-dev-422228629090-check-expired-raffles-CheckExpiredRafflesLambda][0m
[0m[1mmodule.api_gateway.aws_lambda_permission.public_api_gateway_invoke_list_raffles: Refreshing state... [id=AllowPublicAPIGatewayInvoke][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method.public_get_raffles: Refreshing state... [id=agm-qp4jr69io5-xzskfc-GET][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method.public_options_raffles: Refreshing state... [id=agm-qp4jr69io5-xzskfc-OPTIONS][0m
[0m[1mmodule.api_gateway.aws_api_gateway_resource.public_raffle_id: Refreshing state... [id=i74zqd][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method_response.authenticated_options_assets_upload_200: Refreshing state... [id=agmr-v2yvwa8fi4-u62pil-OPTIONS-200][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration.authenticated_options_assets_upload_mock: Refreshing state... [id=agi-v2yvwa8fi4-u62pil-OPTIONS][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method.authenticated_options_close: Refreshing state... [id=agm-v2yvwa8fi4-2n83hs-OPTIONS][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method.authenticated_options_participate: Refreshing state... [id=agm-v2yvwa8fi4-b4g9nm-OPTIONS][0m
[0m[1mmodule.cognito.aws_cognito_user_group.user: Refreshing state... [id=us-east-2_k4ExaaLU9/User][0m
[0m[1mmodule.cognito.aws_cognito_user_pool_domain.rafflenow_domain: Refreshing state... [id=rafflenow-dev-422228629090-auth][0m
[0m[1mmodule.cognito.aws_cognito_user_pool_client.rafflenow_client: Refreshing state... [id=dtcvi818k93g6147n5horh6n7][0m
[0m[1mmodule.cognito.aws_lambda_permission.cognito_post_confirmation: Refreshing state... [id=AllowCognitoInvoke][0m
[0m[1mmodule.cognito.aws_iam_policy.post_confirmation_cognito_policy: Refreshing state... [id=arn:aws:iam::422228629090:policy/rafflenow-dev-422228629090-post-confirmation-cognito-policy][0m
[0m[1mmodule.cognito.aws_cognito_user_group.admin: Refreshing state... [id=us-east-2_k4ExaaLU9/Admin][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration_response.authenticated_options_raffles_200: Refreshing state... [id=agir-v2yvwa8fi4-nzk0cl-OPTIONS-200][0m
[0m[1mmodule.api_gateway.aws_lambda_permission.authenticated_api_gateway_invoke_create_raffle: Refreshing state... [id=AllowAuthenticatedAPIGatewayInvokeCreateRaffle][0m
[0m[1mmodule.compute.aws_lambda_event_source_mapping.sqs_to_image_optimizer: Refreshing state... [id=a18deb33-386c-4626-be67-e98c49f88a39][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration.public_get_raffles_lambda: Refreshing state... [id=agi-qp4jr69io5-xzskfc-GET][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration.public_options_raffles_mock: Refreshing state... [id=agi-qp4jr69io5-xzskfc-OPTIONS][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method_response.public_options_raffles_200: Refreshing state... [id=agmr-qp4jr69io5-xzskfc-OPTIONS-200][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method.public_get_raffle_by_id: Refreshing state... [id=agm-qp4jr69io5-i74zqd-GET][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method.public_options_raffle_by_id: Refreshing state... [id=agm-qp4jr69io5-i74zqd-OPTIONS][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration_response.authenticated_options_assets_upload_200: Refreshing state... [id=agir-v2yvwa8fi4-u62pil-OPTIONS-200][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method_response.authenticated_options_close_200: Refreshing state... [id=agmr-v2yvwa8fi4-2n83hs-OPTIONS-200][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration.authenticated_options_close_mock: Refreshing state... [id=agi-v2yvwa8fi4-2n83hs-OPTIONS][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method_response.authenticated_options_participate_200: Refreshing state... [id=agmr-v2yvwa8fi4-b4g9nm-OPTIONS-200][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration.authenticated_options_participate_mock: Refreshing state... [id=agi-v2yvwa8fi4-b4g9nm-OPTIONS][0m
[0m[1mmodule.cognito.aws_iam_role_policy_attachment.post_confirmation_cognito: Refreshing state... [id=rafflenow-dev-422228629090-post-confirmation-role/arn:aws:iam::422228629090:policy/rafflenow-dev-422228629090-post-confirmation-cognito-policy][0m
[0m[1mmodule.api_gateway.aws_lambda_permission.authenticated_api_gateway_invoke_upload_image: Refreshing state... [id=AllowAuthenticatedAPIGatewayInvokeUploadImage][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration_response.public_options_raffles_200: Refreshing state... [id=agir-qp4jr69io5-xzskfc-OPTIONS-200][0m
[0m[1mmodule.api_gateway.aws_api_gateway_authorizer.cognito_authenticated: Refreshing state... [id=0lpco2][0m
[0m[1mmodule.waf.aws_wafv2_web_acl.regional: Refreshing state... [id=be8f8de0-86a5-493d-ae28-db0f245a6841][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method_response.public_options_raffle_by_id_200: Refreshing state... [id=agmr-qp4jr69io5-i74zqd-OPTIONS-200][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration_response.authenticated_options_close_200: Refreshing state... [id=agir-v2yvwa8fi4-2n83hs-OPTIONS-200][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration.public_options_raffle_by_id_mock: Refreshing state... [id=agi-qp4jr69io5-i74zqd-OPTIONS][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration_response.authenticated_options_participate_200: Refreshing state... [id=agir-v2yvwa8fi4-b4g9nm-OPTIONS-200][0m
[0m[1mmodule.storage.aws_s3_bucket_lifecycle_configuration.assets_lifecycle: Refreshing state... [id=rafflenow-dev-422228629090-assets][0m
[0m[1mmodule.compute.aws_lambda_function.get_raffle: Refreshing state... [id=rafflenow-dev-422228629090-get-raffle][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method.authenticated_post_raffles: Refreshing state... [id=agm-v2yvwa8fi4-nzk0cl-POST][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method.authenticated_post_close: Refreshing state... [id=agm-v2yvwa8fi4-2n83hs-POST][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method.authenticated_post_assets_upload: Refreshing state... [id=agm-v2yvwa8fi4-u62pil-POST][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method.authenticated_post_participate: Refreshing state... [id=agm-v2yvwa8fi4-b4g9nm-POST][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration_response.public_options_raffle_by_id_200: Refreshing state... [id=agir-qp4jr69io5-i74zqd-OPTIONS-200][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration.authenticated_post_raffles_lambda: Refreshing state... [id=agi-v2yvwa8fi4-nzk0cl-POST][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration.authenticated_post_participate_lambda: Refreshing state... [id=agi-v2yvwa8fi4-b4g9nm-POST][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration.authenticated_post_assets_upload_lambda: Refreshing state... [id=agi-v2yvwa8fi4-u62pil-POST][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration.authenticated_post_close_lambda: Refreshing state... [id=agi-v2yvwa8fi4-2n83hs-POST][0m
[0m[1mmodule.api_gateway.aws_api_gateway_deployment.authenticated_api_deployment: Refreshing state... [id=pivjpg][0m
[0m[1mmodule.api_gateway.aws_api_gateway_stage.authenticated_api_stage: Refreshing state... [id=ags-v2yvwa8fi4-dev][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration.public_get_raffle_by_id_lambda: Refreshing state... [id=agi-qp4jr69io5-i74zqd-GET][0m
[0m[1mmodule.api_gateway.aws_lambda_permission.public_api_gateway_invoke_get_raffle: Refreshing state... [id=AllowPublicAPIGatewayInvokeGetRaffle][0m
[0m[1mmodule.monitoring.aws_cloudwatch_dashboard.red_lambdas: Refreshing state... [id=rafflenow-dev-422228629090-red-lambdas][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.lambda_throttles: Refreshing state... [id=rafflenow-dev-422228629090-lambda-throttles][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.lambda_worker_errors: Refreshing state... [id=rafflenow-dev-422228629090-lambda-worker-errors][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.lambda_ingest_errors: Refreshing state... [id=rafflenow-dev-422228629090-lambda-ingest-errors][0m
[0m[1mmodule.monitoring.aws_cloudwatch_query_definition.trace_by_correlation_id: Refreshing state... [id=ce1cd30e-021e-468a-b975-3ada699540af][0m
[0m[1mmodule.monitoring.aws_cloudwatch_query_definition.failed_raffles: Refreshing state... [id=39d04ff9-94e2-4d55-a97b-ae9e07aba086][0m
[0m[1mmodule.monitoring.aws_cloudwatch_query_definition.worker_latency: Refreshing state... [id=3b9ba2ad-5b77-4f5f-adcd-1eb003a22bf8][0m
[0m[1mmodule.monitoring.aws_cloudwatch_query_definition.errors_by_code: Refreshing state... [id=dcb43b61-9040-4bab-8df8-e10a9e6b22cf][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method_settings.authenticated_all: Refreshing state... [id=v2yvwa8fi4-dev-*/*][0m
[0m[1mmodule.api_gateway.aws_api_gateway_deployment.public_api_deployment: Refreshing state... [id=q6495a][0m
[0m[1mmodule.api_gateway.aws_api_gateway_stage.public_api_stage: Refreshing state... [id=ags-qp4jr69io5-dev][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method_settings.public_all: Refreshing state... [id=qp4jr69io5-dev-*/*][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.api_5xx_errors: Refreshing state... [id=rafflenow-dev-422228629090-api-5xx-errors][0m
[0m[1mmodule.monitoring.aws_cloudwatch_dashboard.executive: Refreshing state... [id=rafflenow-dev-422228629090-executive][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.api_high_latency: Refreshing state... [id=rafflenow-dev-422228629090-api-high-latency][0m
[0m[1mmodule.monitoring.aws_cloudwatch_dashboard.golden_signals: Refreshing state... [id=rafflenow-dev-422228629090-golden-signals][0m
[0m[1mmodule.waf.aws_wafv2_web_acl_logging_configuration.cloudfront: Refreshing state... [id=arn:aws:wafv2:us-east-1:422228629090:global/webacl/rafflenow-dev-422228629090-waf-cloudfront/591e37e3-fcab-4daa-b5f6-98a25f883671][0m
[0m[1mmodule.cdn.aws_cloudfront_distribution.assets_cdn: Refreshing state... [id=E1XCQT3IG1TGU8][0m
[0m[1mmodule.cdn.aws_s3_bucket_cors_configuration.assets_cors: Refreshing state... [id=rafflenow-dev-422228629090-assets][0m
[0m[1mmodule.monitoring.aws_cloudwatch_dashboard.use_infrastructure: Refreshing state... [id=rafflenow-dev-422228629090-use-infrastructure][0m
[0m[1mmodule.route53.aws_route53_record.root: Refreshing state... [id=Z1005008KTEZ4T3W4W83_rafflenow.es_A][0m
[0m[1mmodule.route53.aws_route53_record.www: Refreshing state... [id=Z1005008KTEZ4T3W4W83_www.rafflenow.es_A][0m
[0m[1mmodule.waf.aws_wafv2_web_acl_logging_configuration.regional: Refreshing state... [id=arn:aws:wafv2:us-east-2:422228629090:regional/webacl/rafflenow-dev-422228629090-waf-regional/be8f8de0-86a5-493d-ae28-db0f245a6841][0m
[0m[1mmodule.waf.aws_wafv2_web_acl_association.api_gateway_authenticated: Refreshing state... [id=arn:aws:wafv2:us-east-2:422228629090:regional/webacl/rafflenow-dev-422228629090-waf-regional/be8f8de0-86a5-493d-ae28-db0f245a6841,arn:aws:apigateway:us-east-2::/restapis/v2yvwa8fi4/stages/dev][0m
[0m[1mmodule.waf.aws_wafv2_web_acl_association.api_gateway_public: Refreshing state... [id=arn:aws:wafv2:us-east-2:422228629090:regional/webacl/rafflenow-dev-422228629090-waf-regional/be8f8de0-86a5-493d-ae28-db0f245a6841,arn:aws:apigateway:us-east-2::/restapis/qp4jr69io5/stages/dev][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # module.cdn.aws_s3_bucket_lifecycle_configuration.assets_lifecycle[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_s3_bucket_lifecycle_configuration" "assets_lifecycle" {
        id                                     = "rafflenow-dev-422228629090-assets"
        [90m# (4 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m rule {
          [33m~[0m[0m id     = "expire-old-versions" [33m->[0m[0m "delete-old-versions"
            [90m# (2 unchanged attributes hidden)[0m[0m

          [31m-[0m[0m abort_incomplete_multipart_upload {
              [31m-[0m[0m days_after_initiation = 7 [90m-> null[0m[0m
            }

          [33m~[0m[0m noncurrent_version_expiration {
              [33m~[0m[0m noncurrent_days = 90 [33m->[0m[0m 30
            }
        }
      [32m+[0m[0m rule {
          [32m+[0m[0m id     = "delete-incomplete-uploads"
          [32m+[0m[0m status = "Enabled"
            [90m# (1 unchanged attribute hidden)[0m[0m

          [32m+[0m[0m abort_incomplete_multipart_upload {
              [32m+[0m[0m days_after_initiation = 7
            }
        }
    }

[1m  # module.cognito.aws_lambda_function.post_confirmation[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_lambda_function" "post_confirmation" {
        id                             = "rafflenow-dev-422228629090-post-confirmation"
      [33m~[0m[0m last_modified                  = "2025-12-01T15:02:34.000+0000" -> (known after apply)
      [33m~[0m[0m source_code_hash               = "9NbCGoLm02pV7It3UA1Jz5cGNK1CssINPS0KLUhVjho=" [33m->[0m[0m "VZLk8VDiQNtxoS15CdEzr3ZLq0x9X3+R4VOqPSfNtk4="
        tags                           = {
            "Environment" = "dev"
            "Name"        = "rafflenow-dev-422228629090-post-confirmation"
            "Project"     = "RaffleNow"
            "Type"        = "Lambda"
        }
        [90m# (29 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # module.compute.aws_lambda_function.check_expired_raffles[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_lambda_function" "check_expired_raffles" {
        id                             = "rafflenow-dev-422228629090-check-expired-raffles"
      [33m~[0m[0m last_modified                  = "2025-12-01T15:02:18.000+0000" -> (known after apply)
      [33m~[0m[0m source_code_hash               = "XYeVvDuv5UCaGIZ2jvAe1nZ5+o1B182pudVb3+s6lKs=" [33m->[0m[0m "+bswbl185C9FicD+oYZpv5qiBaYPLY6DtQBFZV90SPw="
        tags                           = {
            "Environment" = "dev"
            "Name"        = "rafflenow-dev-422228629090-check-expired-raffles"
            "Project"     = "RaffleNow"
            "Type"        = "Lambda"
        }
        [90m# (29 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # module.compute.aws_lambda_function.close_raffle[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_lambda_function" "close_raffle" {
        id                             = "rafflenow-dev-422228629090-close-raffle"
      [33m~[0m[0m last_modified                  = "2025-12-01T15:02:26.000+0000" -> (known after apply)
      [33m~[0m[0m source_code_hash               = "aAIhiSGvcnK3stDX0K8MkilMpP6eyFUcdYYul6M4sIw=" [33m->[0m[0m "k5vuB+42nk41UlXBDCLY8uK4JgnB8uzMzLDN7c/9H8U="
        tags                           = {
            "Environment" = "dev"
            "Name"        = "rafflenow-dev-422228629090-close-raffle"
            "Project"     = "RaffleNow"
            "Type"        = "Lambda"
        }
        [90m# (29 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # module.compute.aws_lambda_function.create_raffle[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_lambda_function" "create_raffle" {
        id                             = "rafflenow-dev-422228629090-create-raffle"
      [33m~[0m[0m last_modified                  = "2025-12-01T15:02:09.000+0000" -> (known after apply)
      [33m~[0m[0m source_code_hash               = "qilFJBfUKFi5lKW+S8KifwRuxBt3VGZAdwGdqlt6HF8=" [33m->[0m[0m "5vZXPwZ2HHQZWaL4NkkFuyaTwovYFjvs7Fq/KrzdbrE="
        tags                           = {
            "Environment" = "dev"
            "Name"        = "rafflenow-dev-422228629090-create-raffle"
            "Project"     = "RaffleNow"
            "Type"        = "Lambda"
        }
        [90m# (29 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # module.compute.aws_lambda_function.get_raffle[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_lambda_function" "get_raffle" {
        id                             = "rafflenow-dev-422228629090-get-raffle"
      [33m~[0m[0m last_modified                  = "2025-12-01T15:03:40.000+0000" -> (known after apply)
      [33m~[0m[0m source_code_hash               = "523fiYjnvaxzbHQKmzRYTIaeVa51jdSIq8bKxnHM3Zc=" [33m->[0m[0m "LWg9J5rhBK4VinhsgICghGHSlBw6tcje5ZQ8pCSECbY="
        tags                           = {
            "Environment" = "dev"
            "Name"        = "rafflenow-dev-422228629090-get-raffle"
            "Project"     = "RaffleNow"
            "Type"        = "Lambda"
        }
        [90m# (29 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # module.compute.aws_lambda_function.image_optimizer[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_lambda_function" "image_optimizer" {
        id                             = "rafflenow-dev-422228629090-image-optimizer"
      [33m~[0m[0m last_modified                  = "2025-12-01T15:02:53.000+0000" -> (known after apply)
      [33m~[0m[0m source_code_hash               = "DoOnE7dVG/MzFCGtw6mvUc/P06OGZ2HtwQkOcPgpqbo=" [33m->[0m[0m "uI0yfUYssxdo8r7gKczLW2ZXOnW8ajrPFSlVdlUFT5I="
        tags                           = {
            "Environment" = "dev"
            "Name"        = "rafflenow-dev-422228629090-image-optimizer"
            "Project"     = "RaffleNow"
            "Type"        = "Lambda"
        }
        [90m# (29 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # module.compute.aws_lambda_function.ingest_participation[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_lambda_function" "ingest_participation" {
        id                             = "rafflenow-dev-422228629090-ingest-participation"
      [33m~[0m[0m last_modified                  = "2025-12-01T15:03:02.000+0000" -> (known after apply)
      [33m~[0m[0m source_code_hash               = "wfUeiWXzlZNVzDLJnroYy/snnqiLHVpmc6iel6r0Vh8=" [33m->[0m[0m "0kF7MVKwgGGFXIG1Tvexa6AM31J7Oy3JfJmEpclEWX8="
        tags                           = {
            "Environment" = "dev"
            "Name"        = "rafflenow-dev-422228629090-ingest-participation"
            "Project"     = "RaffleNow"
            "Type"        = "Lambda"
        }
        [90m# (29 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # module.compute.aws_lambda_function.list_raffles[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_lambda_function" "list_raffles" {
        id                             = "rafflenow-dev-422228629090-list-raffles"
      [33m~[0m[0m last_modified                  = "2025-12-01T15:02:01.000+0000" -> (known after apply)
      [33m~[0m[0m source_code_hash               = "MNA3R6suOmmBrgaWcoMAUyL/DmvKxCHCBAb1I5MBM04=" [33m->[0m[0m "oA/8G3ommIFVPqvS2PD+GkeglMEZYfAPktVzvZZ6F4M="
        tags                           = {
            "Environment" = "dev"
            "Name"        = "rafflenow-dev-422228629090-list-raffles"
            "Project"     = "RaffleNow"
            "Type"        = "Lambda"
        }
        [90m# (29 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # module.compute.aws_lambda_function.participation_process[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_lambda_function" "participation_process" {
        id                             = "rafflenow-dev-422228629090-participation-process"
      [33m~[0m[0m last_modified                  = "2025-12-01T15:03:11.000+0000" -> (known after apply)
      [33m~[0m[0m source_code_hash               = "L6kFXGdfHCGRt0yuITFRes5NMxjeSUxGMFcRcDC4l5Y=" [33m->[0m[0m "O/ZNUtYQ4ZqAGHPXvfJk5N8+mUFC3jkImGjKN4hqnCA="
        tags                           = {
            "Environment" = "dev"
            "Name"        = "rafflenow-dev-422228629090-participation-process"
            "Project"     = "RaffleNow"
            "Type"        = "Lambda"
        }
        [90m# (29 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # module.compute.aws_lambda_function.upload_image[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_lambda_function" "upload_image" {
        id                             = "rafflenow-dev-422228629090-upload-image"
      [33m~[0m[0m last_modified                  = "2025-12-01T15:02:43.000+0000" -> (known after apply)
      [33m~[0m[0m source_code_hash               = "qFwBywORTIYbjLxFNxjMPeobZD+PdMvDlwQh86jokmw=" [33m->[0m[0m "c82BxfHFhx4Cyj7vJAnEEq+6shoWpRws34o+ecK3Q+U="
        tags                           = {
            "Environment" = "dev"
            "Name"        = "rafflenow-dev-422228629090-upload-image"
            "Project"     = "RaffleNow"
            "Type"        = "Lambda"
        }
        [90m# (29 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # module.compute.aws_lambda_function.worker_process[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_lambda_function" "worker_process" {
        id                             = "rafflenow-dev-422228629090-worker-process"
      [33m~[0m[0m last_modified                  = "2025-12-01T15:03:32.000+0000" -> (known after apply)
      [33m~[0m[0m layers                         = [
          [31m-[0m[0m "arn:aws:lambda:us-east-2:422228629090:layer:rafflenow-dev-422228629090-worker-process-dependencies:10",
        ] -> (known after apply)
      [33m~[0m[0m source_code_hash               = "HnzKB8WjftRk+7eU1XYFMNV7dP74RV+P6Zzd2SBgwks=" [33m->[0m[0m "i3edHlsRm4mIQmHrBpencV04VMFceds481Wv8nydXNQ="
        tags                           = {
            "Environment" = "dev"
            "Name"        = "rafflenow-dev-422228629090-worker-process"
            "Project"     = "RaffleNow"
            "Type"        = "Lambda"
        }
        [90m# (28 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # module.compute.aws_lambda_layer_version.worker_process_dependencies[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_layer_version" "worker_process_dependencies" {
      [33m~[0m[0m arn                         = "arn:aws:lambda:us-east-2:422228629090:layer:rafflenow-dev-422228629090-worker-process-dependencies:10" -> (known after apply)
      [33m~[0m[0m code_sha256                 = "6gs4mI83zBlAgw2ID1lTjtzeYpomuuI6h0PDOdBbreA=" -> (known after apply)
      [31m-[0m[0m compatible_architectures    = [] [90m-> null[0m[0m
      [33m~[0m[0m created_date                = "2025-12-01T15:02:08.759+0000" -> (known after apply)
      [33m~[0m[0m id                          = "arn:aws:lambda:us-east-2:422228629090:layer:rafflenow-dev-422228629090-worker-process-dependencies:10" -> (known after apply)
      [33m~[0m[0m layer_arn                   = "arn:aws:lambda:us-east-2:422228629090:layer:rafflenow-dev-422228629090-worker-process-dependencies" -> (known after apply)
      [32m+[0m[0m signing_job_arn             = (known after apply)
      [32m+[0m[0m signing_profile_version_arn = (known after apply)
      [33m~[0m[0m source_code_hash            = "6gs4mI83zBlAgw2ID1lTjtzeYpomuuI6h0PDOdBbreA=" [33m->[0m[0m "N5Y+0yOkjePVbO+iZMzcoJCxmk0t5IlvXNEfHNp2n5w=" [31m# forces replacement[0m[0m
      [33m~[0m[0m source_code_size            = 18890148 -> (known after apply)
      [33m~[0m[0m version                     = "10" -> (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # module.ses.aws_ses_template.participation_confirmation[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_ses_template" "participation_confirmation" {
      [33m~[0m[0m html    = <<-EOT
            <!DOCTYPE html>
            <html>
            
            <head>
              <meta charset="UTF-8">
              <meta name="viewport" content="width=device-width, initial-scale=1.0">
            </head>
            
            <body style="margin: 0; padding: 0; font-family: 'Segoe UI', Arial, sans-serif; background-color: #f5f5f5;">
              <table width="100%" cellpadding="0" cellspacing="0"
                style="max-width: 600px; margin: 0 auto; background-color: #ffffff;">
                <tr>
                  <td
                    style="background: linear-gradient(135deg, #667eea 0%, #764ba2 100%); padding: 40px 20px; text-align: center;">
          [31m-[0m[0m         <h1 style="color: #ffffff; margin: 0; font-size: 28px;">\uD83C\uDF89 ¡Participación Confirmada!</h1>
          [32m+[0m[0m         <h1 style="color: #ffffff; margin: 0; font-size: 28px;">🎉 ¡Participación Confirmada!</h1>
                  </td>
                </tr>
                <tr>
                  <td style="padding: 40px 30px;">
                    <p style="font-size: 18px; color: #333; margin: 0 0 20px;">
                      Hola <strong>{{participant_name}}</strong>,
                    </p>
                    <p style="font-size: 16px; color: #555; line-height: 1.6; margin: 0 0 30px;">
                      Tu participación en el sorteo <strong>"{{raffle_title}}"</strong> ha sido registrada exitosamente.
                    </p>
                    <table width="100%" cellpadding="0" cellspacing="0"
                      style="background-color: #f8f9fa; border-radius: 8px; margin-bottom: 30px;">
                      <tr>
                        <td style="padding: 15px;">
                          <p style="margin: 0 0 10px; color: #666; font-size: 14px;">Detalles del sorteo:</p>
                          <p style="margin: 0 0 8px; color: #333; font-size: 16px;">
                            <strong>Premio:</strong> {{prize_description}}
                          </p>
                          <p style="margin: 0 0 8px; color: #333; font-size: 16px;">
                            <strong>Valor:</strong> S/ {{prize_value}}
                          </p>
                          <p style="margin: 0 0 8px; color: #333; font-size: 16px;">
                            <strong>Fecha de cierre:</strong> {{end_date}}
                          </p>
                          <p style="margin: 0; color: #667eea; font-size: 16px;">
                            <strong>Tu número de participación:</strong> #{{participation_number}}
                          </p>
                        </td>
                      </tr>
                    </table>
                    <p style="font-size: 14px; color: #888; line-height: 1.6; margin: 0;">
          [31m-[0m[0m           Te notificaremos por este medio si resultas ganador. ¡Buena suerte! \uD83C\uDF40
          [32m+[0m[0m           Te notificaremos por este medio si resultas ganador. ¡Buena suerte! 🍀
                    </p>
                  </td>
                </tr>
                <tr>
                  <td style="background-color: #f8f9fa; padding: 20px 30px; text-align: center;">
                    <p style="margin: 0; color: #888; font-size: 12px;">
                      © 2025 RaffleNow. Todos los derechos reservados.
                    </p>
                  </td>
                </tr>
              </table>
            </body>
            
            </html>
        EOT
        id      = "rafflenow-dev-422228629090-participation-confirmation"
        name    = "rafflenow-dev-422228629090-participation-confirmation"
        [90m# (4 unchanged attributes hidden)[0m[0m
    }

[1m  # module.ses.aws_ses_template.winner_notification[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_ses_template" "winner_notification" {
      [33m~[0m[0m html    = <<-EOT
            <!DOCTYPE html>
            <html>
            
            <head>
              <meta charset="UTF-8">
              <meta name="viewport" content="width=device-width, initial-scale=1.0">
            </head>
            
            <body style="margin: 0; padding: 0; font-family: 'Segoe UI', Arial, sans-serif; background-color: #f5f5f5;">
              <table width="100%" cellpadding="0" cellspacing="0"
                style="max-width: 600px; margin: 0 auto; background-color: #ffffff;">
                <tr>
                  <td
                    style="background: linear-gradient(135deg, #f093fb 0%, #f5576c 100%); padding: 50px 20px; text-align: center;">
          [31m-[0m[0m         <h1 style="color: #ffffff; margin: 0; font-size: 32px;">\uD83C\uDF8A ¡FELICIDADES!</h1>
          [32m+[0m[0m         <h1 style="color: #ffffff; margin: 0; font-size: 32px;">🎊 ¡FELICIDADES!</h1>
                    <p style="color: #ffffff; margin: 15px 0 0; font-size: 20px; opacity: 0.9;">¡Eres el ganador!</p>
                  </td>
                </tr>
                <tr>
                  <td style="padding: 40px 30px;">
                    <p style="font-size: 20px; color: #333; margin: 0 0 20px;">
                      Hola <strong>{{winner_name}}</strong>,
                    </p>
                    <p style="font-size: 16px; color: #555; line-height: 1.6; margin: 0 0 30px;">
                      ¡Increíbles noticias! Has sido seleccionado como el <strong>GANADOR</strong> del sorteo
                      <strong>"{{raffle_title}}"</strong>.
                    </p>
                    <table width="100%" cellpadding="0" cellspacing="0"
                      style="background: linear-gradient(135deg, #667eea 0%, #764ba2 100%); border-radius: 12px; margin-bottom: 30px;">
                      <tr>
                        <td style="padding: 25px; text-align: center;">
                          <p
                            style="margin: 0 0 10px; color: rgba(255,255,255,0.8); font-size: 14px; text-transform: uppercase; letter-spacing: 1px;">
                            Tu premio</p>
                          <p style="margin: 0 0 15px; color: #ffffff; font-size: 24px; font-weight: bold;">
                            {{prize_description}}
                          </p>
                          <p style="margin: 0; color: #ffffff; font-size: 28px; font-weight: bold;">
                            S/ {{prize_value}}
                          </p>
                        </td>
                      </tr>
                    </table>
                    <table width="100%" cellpadding="0" cellspacing="0"
                      style="background-color: #f8f9fa; border-radius: 8px; margin-bottom: 30px;">
                      <tr>
                        <td style="padding: 20px;">
                          <p style="margin: 0 0 15px; color: #333; font-size: 16px; font-weight: bold;">
          [31m-[0m[0m                 \uD83D\uDCCA Estadísticas del sorteo:
          [32m+[0m[0m                 📊 Estadísticas del sorteo:
                          </p>
                          <p style="margin: 0 0 8px; color: #555; font-size: 14px;">
                            Total de participantes: <strong>{{total_participants}}</strong>
                          </p>
                          <p style="margin: 0; color: #555; font-size: 14px;">
                            Fecha de selección: <strong>{{selected_at}}</strong>
                          </p>
                        </td>
                      </tr>
                    </table>
                    <div
                      style="background-color: #fff3cd; border-left: 4px solid #ffc107; padding: 15px; margin-bottom: 30px; border-radius: 0 8px 8px 0;">
                      <p style="margin: 0; color: #856404; font-size: 14px;">
          [31m-[0m[0m             <strong>\uD83D\uDCE7 Próximos pasos:</strong><br>
          [32m+[0m[0m             <strong>📧 Próximos pasos:</strong><br>
                        Nos pondremos en contacto contigo en las próximas 24-48 horas para coordinar la entrega de tu premio.
                      </p>
                    </div>
                    <p style="font-size: 14px; color: #888; line-height: 1.6; margin: 0;">
          [31m-[0m[0m           ¡Gracias por participar en RaffleNow! \uD83C\uDF89
          [32m+[0m[0m           ¡Gracias por participar en RaffleNow! 🎉
                    </p>
                  </td>
                </tr>
                <tr>
                  <td style="background-color: #f8f9fa; padding: 20px 30px; text-align: center;">
                    <p style="margin: 0; color: #888; font-size: 12px;">
                      © 2025 RaffleNow. Todos los derechos reservados.
                    </p>
                  </td>
                </tr>
              </table>
            </body>
            
            </html>
        EOT
        id      = "rafflenow-dev-422228629090-winner-notification"
        name    = "rafflenow-dev-422228629090-winner-notification"
      [33m~[0m[0m text    = <<-EOT
          [31m-[0m[0m \uD83C\uDF8A ¡FELICIDADES! ¡Eres el ganador!
          [32m+[0m[0m 🎊 ¡FELICIDADES! ¡Eres el ganador!
            
            Hola {{winner_name}},
            
            ¡Increíbles noticias! Has sido seleccionado como el GANADOR del sorteo "{{raffle_title}}".
            
            Tu premio:
            {{prize_description}}
            Valor: S/ {{prize_value}}
            
            Estadísticas del sorteo:
            - Total de participantes: {{total_participants}}
            - Fecha de selección: {{selected_at}}
            
            Próximos pasos:
            Nos pondremos en contacto contigo en las próximas 24-48 horas para coordinar la entrega de tu premio.
            
            ¡Gracias por participar en RaffleNow!
            
            © 2025 RaffleNow
        EOT
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 14 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>